/**********************************************************
 * Author         : huang
 * Creat modified : 2020-07-20 20:12
 * Last modified  : 2020-07-20 20:12
 * Filename       : 15_二维数组.c
 * Description    : 
 * *******************************************************/

#include <stdio.h>

int main()
{
	//1. 有多少[]就有多少维
	//2. 内存中没有多维,都只有一维,多维数组是特殊的一维数组
	//3. 定义了一个一维数组a[3],这个一维数组有3个元素,每个元素int[4]
	//4. a[0], a[1], a[2]就是第0,1,2元素的数组名
	//5. 二维数组,用户可以理解为m行n列,没有a[3][4]次元素
	int a[3][4];
	
	int i, j;
	int num = 0;
	/*
	 1. i = 0, i < 3
	    j = 0, j < 4, a[0][0]
	    j = 1, j < 4, a[0][1]
	    j = 2, j < 4, a[0][2]
	    j = 3, j < 4, a[0][3]
	    j = 4, j < 4, 跳出循环for(j = 0; j < 4; ++j)
	 
	 2. i = 1, i < 3
	    j = 0, j < 4, a[1][0]
	    ......
	    j = 4, j < 4, 跳出循环for(j = 0; j < 4; ++j)

	 ......
	 */
	for(i = 0; i < 3; ++i)
	{
		for(j = 0; j < 4; ++j)
		{
			a[i][j] = num;
			++num;
		}
	}

	for(i = 0; i < 3; ++i)
	{
		for(j = 0; j < 4; ++j)
			printf("%5d", a[i][j]);
		printf("\n");
	}

	return 0;
}
