/**********************************************************
 * Author         : huang
 * Creat modified : 2020-07-20 21:14
 * Last modified  : 2020-07-20 21:14
 * Filename       : 18_二维数组练习.c
 * Description    : 
 * *******************************************************/

#include <stdio.h>

int main()
{
	int a[5][3] = {
		{30, 60, 80},
		{60, 60, 60},
		{77, 88, 99},
		{88, 66, 77},
		{12, 22, 8}
	};

	//求每个科目平均分
	int sum = 0;
	int i, j;
	for(j = 0; j < 3; ++j)
	{
		sum = 0;
		for(i = 0; i < 5; ++i)
		{
			sum += a[i][j];
		}
		printf("平均分 = %lf\n", sum / 5.0);
	}

	return 0;
}
