/**********************************************************
 * Author         : huang
 * Creat modified : 2020-07-28 19:45
 * Last modified  : 2020-07-28 19:45
 * Filename       : 04_指针变量的定义和使用.c
 * Description    : 
 * *******************************************************/

#include <stdio.h>

int main()
{
	//1.指针也是一种数据类型
	//p是一个变量,p的类型是int *
	int * p;
	p = 123;
	printf("%p\n", p);

	//2.指针指向谁,就把谁的地址赋值给指针
	int a = 10;
	p = &a; //p保存了a的地址
	//%p打印地址,是以16进制的方式打印
	printf("%p, %p\n", p, &a);

	//3.直接操作指针变量本身没有意义
	//p = 345;
	//printf("p = %d\n", p);
	
	//4.需要操作*p.操作指针所指向的内存
	*p = 100; //*p相当于a
	printf("%d, %d\n", *p, a);

	return 0;
}
