/**********************************************************
 * Author         : huang
 * Creat modified : 2020-07-28 20:08
 * Last modified  : 2020-07-28 20:08
 * Filename       : 05_指针变量和指针所指向的内存的区别.c
 * Description    : 
 * *******************************************************/

#include <stdio.h>

int main()
{
	int a = 10;

	//*有2层含义
	//1. 定义变量时, *代表类型, 它是指针类型int *
	int *p;
	p = &a;

	//2. 在使用变量时,*代表操作指针所指向的内存
	*p = 100;
	printf("a = %d\n", a);

	int b = 11;
	p = &b;
	*p = 200;
	printf("a = %d, b = %d\n", a, b);
}
