//005_signed_and_unsigned_difference.c
#include <stdio.h>

/*
有符号和无符号的区别:
1)有符号,最高位为符号位,0代表正数，1代表负数；
2)无符号,最高位不是符号位,是数的一部分,无符号不可能是负数
*/

int main(int argc, char *argv[]){
	/*
	 1000 0000 0000 0000 0000 0000 0111 1011
	 8    0	   0	0    0	  0    7    b

	 //%d,默认以有符号的方式打印
	 //原码:1000 0000 0000 0000 0000 0000 0111 1011
	 //反码:1111 1111 1111 1111 1111 1111 1000 0100
	 //补码:1111 1111 1111 1111 1111 1111 1000 0101
	 //	-7   f	  f    f    f	 f    8	   5 = -2147483525
	 */
	printf("%d\n", 0x8000007b);
	//%u,以无符号的方式打印
	printf("%u\n", 0x8000007b);

	//等价于int a = -10;
	signed int a = -10;

	unsigned int b = 10;

	unsigned int c = 0x8000007b;
	printf("c1 = %d\n", c);	//输出结果以%d为准,%d以有符号方式输出
	printf("c2 = %u\n", c);

	return 0;
}
