/**********************************************************
 * Author         : huang
 * Creat modified : 2020-08-02 17:59
 * Last modified  : 2020-08-02 17:59
 * Filename       : 02_普通局部变量.c
 * Description    : 
 * *******************************************************/
#include <stdio.h>

int main()
{
	int a = 10;

	if(1)
	{
		int a = 11;
		//就近原则
		printf("a = %d\n", a); //a = 11

		//int a = 12; //error,重复定义
	}

	//1. if()的a只能在if()中使用
	//2. 离开if(),if中的a已经释放
	printf("a = %d\n", a); //a = 10

	return 0;
}

int main01()
{
	//1. 在{}内部定义的变量就是局部变量
	//2. 只有执行到定义变量的这个语句,系统才会给变量分配空间
	//3. 当离开{},这个非static局部自动释放
	//4. 局部变量的作用域在当前的{},离开此{},无法使用此变量
	//5. {}的普通局部变量,加不加auto关键字等价,不同局部变量也叫自动变量
	//6. 不同的{}中,变量名字可以一样,可以把{}类比房子,不同房子可以有同名的人
	auto int tmp = 11; //加不加auto关键字等价

	{
		int a = 10;
		{
			a = 100; //ok,还在作用域范围内
		}
	}
	//a = 100; //error,'a'未定义,离开作用域
	
	if(1)
	{
		int b = 10;
	}
	//b = 100; //error,离开作用域
	
	for(int i = 0; i < 10; ++i)
	{//i只属于for语句,离开for就不能使用
		i = 11; //ok,在作用域
	}
	printf("i = %d\n", i); //error,离开作用域

	return 0;
}
